{
  "resourceType": "StructureDefinition",
  "language": "ja",
  "url": "http://jpfhir.jp/fhir/core/StructureDefinition/JP_AllergyIntolerance",
  "version": "1.0.0",
  "name": "JP_AllergyIntolerance",
  "title": "JP_AllergyIntolerance",
  "status": "active",
  "experimental": false,
  "date": "2021-12-03T06:03:05.9665854+00:00",
  "publisher": "FHIR® Japanese implementation research working group in Japan Association of Medical Informatics (JAMI)",
  "description": "本プロファイルはAllergyIntoleranceリソースに対して、患者のアレルギーや不耐症に関するデータを送受信するための基礎となる制約と拡張を定めたものである。",
  "copyright": "FHIR® Japanese implementation research working group in Japan Association of Medical Informatics (JAMI)",
  "fhirVersion": "4.0.1",
  "mapping": [
    {
      "identity": "rim",
      "uri": "http://hl7.org/v3",
      "name": "RIM Mapping"
    },
    {
      "identity": "w5",
      "uri": "http://hl7.org/fhir/fivews",
      "name": "FiveWs Pattern Mapping"
    },
    {
      "identity": "v2",
      "uri": "http://hl7.org/v2",
      "name": "HL7 v2 Mapping"
    }
  ],
  "kind": "resource",
  "abstract": false,
  "type": "AllergyIntolerance",
  "baseDefinition": "http://hl7.org/fhir/StructureDefinition/AllergyIntolerance",
  "derivation": "constraint",
  "differential": {
    "element": [
      {
        "id": "AllergyIntolerance",
        "path": "AllergyIntolerance",
        "short": "患者のアレルギーや不耐症 (一般的には、、特定の物質への暴露に対する有害反応)",
        "definition": "Risk of harmful or undesirable, physiological response which is unique to an individual and associated with exposure to a substance.\r\n\r\nリソースは患者のアレルギーや不耐症を表現する。\r\n具体的には、特定の物質または物質群への将来の暴露に対して有害反応を起こす傾向、または患者に対する潜在的なリスクを表現する。",
        "comment": "Substances include, but are not limited to: a therapeutic substance administered correctly at an appropriate dosage for the individual; food; material derived from plants or animals; or venom from insect stings.\r\n\r\nアレルギー又は不耐症の対象物質は、医薬品（適切な用量で正しく投与された場合）、化学物質、食べ物、植物や動物に由来する物質、または昆虫刺傷からの毒などである。"
      },
      {
        "id": "AllergyIntolerance.identifier",
        "path": "AllergyIntolerance.identifier",
        "short": "この事象を識別するID",
        "definition": "Business identifiers assigned to this AllergyIntolerance by the performer or other systems which remain constant as the resource is updated and propagates from server to server.\r\n\r\n実行者または他のシステムによってこのAllergyIntoleranceに割り当てられたビジネス識別子。リソースが更新され、サーバーからサーバーに伝送するときにも変化しない。",
        "comment": "This is a business identifier, not a resource identifier (see [discussion](resource.html#identifiers)).  It is best practice for the identifier to only appear on a single resource instance, however business practices may occasionally dictate that multiple resource instances with the same identifier can exist - possibly even with different resource types.  For example, multiple Patient and a Person resource instance might share the same social insurance number.\r\n\r\nこれはビジネス識別子であり、リソース識別子ではない。全インスタンスを通して識別子は単一インスタンスを指し示すことがベストである。しかし、異なるリソースタイプの複数のリソースインスタンスに同じ識別子を割り当てることも稀にはある。例えば、重複するPatientリソースインスタンスとPersonリソースインスタンスは同じソーシャルセキュリティー番号を共有することなどである。",
        "requirements": "情報を相互に利用するサーバー間で一貫性を保つ方法でAllergyIntoleranceを識​​別できることが求められる。"
      },
      {
        "id": "AllergyIntolerance.clinicalStatus",
        "path": "AllergyIntolerance.clinicalStatus",
        "short": "active | inactive | resolved のいずれか",
        "definition": "The clinical status of the allergy or intolerance.\r\n\r\nアレルギーまたは不耐性の臨床状態",
        "comment": "Refer to [discussion](extensibility.html#Special-Case) if clincalStatus is missing data.\nThe data type is CodeableConcept because clinicalStatus has some clinical judgment involved, such that there might need to be more specificity than the required FHIR value set allows. For example, a SNOMED coding might allow for additional specificity.\r\n\r\nアレルギー・不耐性がアクティブでない場合（inactive | resolved）があるため、この要素は修飾子として用いられる。\r\nValue set http://hl7.org/fhir/ValueSet/allergyintolerance-clinical\r\n用語例 active, inactive, resolved",
        "mustSupport": false
      },
      {
        "id": "AllergyIntolerance.verificationStatus",
        "path": "AllergyIntolerance.verificationStatus",
        "short": "unconfirmed | confirmed | refuted | entered-in-error のいずれか",
        "definition": "Assertion about certainty associated with the propensity, or potential risk, of a reaction to the identified substance (including pharmaceutical product).\r\n\r\n特定された物質（医薬品を含む）に対する反応の傾向または潜在的なリスクの確実性の度合い",
        "comment": "The data type is CodeableConcept because verificationStatus has some clinical judgment involved, such that there might need to be more specificity than the required FHIR value set allows. For example, a SNOMED coding might allow for additional specificity.\r\n\r\nこのステータスには不確かな場合（refuted | entered-in-error）が含まれるため、修飾子として用いられる。\r\nValue set http://hl7.org/fhir/ValueSet/allergyintolerance-verification\r\n用語例 unconfirmed, confirmed, refuted, entered-in-error",
        "mustSupport": false
      },
      {
        "id": "AllergyIntolerance.type",
        "path": "AllergyIntolerance.type",
        "short": "allergy | intolerance",
        "definition": "Identification of the underlying physiological mechanism for the reaction risk.\r\n\r\n反応リスクの根底にある生理学的メカニズムの特定ができる場合にアレルギーか不耐性(不寛容)かを区分する",
        "comment": "Allergic (typically immune-mediated) reactions have been traditionally regarded as an indicator for potential escalation to significant future risk. Contemporary knowledge suggests that some reactions previously thought to be immune-mediated are, in fact, non-immune, but in some cases can still pose a life threatening risk. It is acknowledged that many clinicians might not be in a position to distinguish the mechanism of a particular reaction. Often the term \"allergy\" is used rather generically and may overlap with the use of \"intolerance\" - in practice the boundaries between these two concepts might not be well-defined or understood. This data element is included nevertheless, because many legacy systems have captured this attribute. Immunologic testing may provide supporting evidence for the basis of the reaction and the causative substance, but no tests are 100% sensitive or specific for sensitivity to a particular substance. If, as is commonly the case, it is unclear whether the reaction is due to an allergy or an intolerance, then the type element should be omitted from the resource.\r\n\r\nアレルギー性（通常は免疫性）反応は、伝統的に、重大な将来のリスクへの潜在的なエスカレーションの指標と見なされてきた。現代の知識は、以前は免疫介在性であると考えられていたいくつかの反応が実際には非免疫であると示唆しているが、場合によっては生命を脅かすリスクをもたらす可能性がある。多くの臨床医が特定の反応のメカニズムを区別できる立場にない可能性があることは認められている。多くの場合、「アレルギー」という用語はかなり一般的に使用され、「不耐性(不寛容)」の使用と重複する場合がある。実際には、これら2つの概念の境界は明確に定義または理解されていない可能性がある。免疫学的検査は、反応と原因物質の根拠を裏付ける証拠を提供する可能性がありますが、特定の物質に対する感受性について100％感度または特異的な検査はない。反応がアレルギーによるものなのか不耐性(不寛容)によるものなのかが不明な場合は、type要素を使わない。"
      },
      {
        "id": "AllergyIntolerance.category",
        "path": "AllergyIntolerance.category",
        "short": "jp_food | jp_medication | jp_environment_others",
        "definition": "Category of the identified substance.\r\n\r\n同定された物質のカテゴリー",
        "comment": "This data element has been included because it is currently being captured in some clinical systems. This data can be derived from the substance where coding systems are used, and is effectively redundant in that situation. When searching on category, consider the implications of AllergyIntolerance resources without a category. For example, when searching on category = medication, medication allergies that don't have a category valued will not be returned. Refer to search for more information on how to search category with a :missing modifier to get allergies that don't have a category. Additionally, category should be used with caution because category can be subjective based on the sender.\r\n\r\nこのデータは、コーディングシステムが使用されている物質のコードから導き出すことができるので本category要素の情報と重複し、冗長である。カテゴリを検索するときは、カテゴリのないAllergyIntoleranceリソースがあることを考慮する必要がある。たとえば、category =投薬で検索する場合、カテゴリがこの要素に設定されていない投薬アレルギーは返されないことに注意。カテゴリを持たないアレルギーを取得するために：missing修飾子を使用してカテゴリを検索する方法の詳細については、searchを参照すること。さらに、カテゴリは送信者に基づいて主観的になる可能性があるため、注意して使用する必要がある。"
      },
      {
        "id": "AllergyIntolerance.criticality",
        "path": "AllergyIntolerance.criticality",
        "definition": "Estimate of the potential clinical harm, or seriousness, of the reaction to the identified substance.\r\n\r\n同定された物質に対する反応の潜在的な臨床的危害または深刻さの推定。",
        "comment": "The default criticality value for any propensity to an adverse reaction should be 'Low Risk', indicating at the very least a relative contraindication to deliberate or voluntary exposure to the substance. 'High Risk' is flagged if the clinician has identified a propensity for a more serious or potentially life-threatening reaction, such as anaphylaxis, and implies an absolute contraindication to deliberate or voluntary exposure to the substance. If this element is missing, the criticality is unknown (though it may be known elsewhere).  Systems that capture a severity at the condition level are actually representing the concept of criticality whereas the severity documented at the reaction level is representing the true reaction severity.  Existing systems that are capturing both condition criticality and reaction severity may use the term \"severity\" to represent both.  Criticality is the worst it could be in the future (i.e. situation-agnostic) whereas severity is situation-dependent.\r\n\r\n有害反応の傾向のデフォルト値は「低リスク」である必要があり、少なくとも物質への意図的または自発的な曝露に対する相対的な禁忌を示す。臨床医がアナフィラキシーなどのより深刻な、または生命を脅かす可能性のある反応の傾向を特定した場合、「高リスク」のフラグが立てられ、物質への意図的または自発的な曝露に対する絶対禁忌を意味する。この要素が欠落している場合、重要度は不明です（他の場所でわかっている可能性がある）。conditionレベルでseverity（重大度）を格納し利用するシステムは、実際にはseverity（重大度）の概念を表しているのに対して、reactionレベルで文書化されている重大度は、実際のreaction（反応）のseverity（重大度を表している。conditionレベルの重大度とreactionレベルの重大度の両方を格納し利用している既存のシステムでは、「重大度」という用語を使用して両方のレベルを表す場合がある。Criticality（重要度）は将来的に最も悪い状態になる可能性がある（つまり、状況に依存しません）が、severity（重大度）は状況に依存する概念である。"
      },
      {
        "id": "AllergyIntolerance.code",
        "path": "AllergyIntolerance.code",
        "code": [
          {
            "system": "http://jpfhir.jp/fhir/Common/CodeSystem/allergyintolerance-code"
          }
        ],
        "short": "アレルギーまたは不耐性を識別するコード",
        "definition": "Code for an allergy or intolerance statement (either a positive or a negated/excluded statement). This may be a code for a substance or pharmaceutical product that is considered to be responsible for the adverse reaction risk (e.g., \"Latex\"), an allergy or intolerance condition (e.g., \"Latex allergy\"), or a negated/excluded code for a specific substance or class (e.g., \"No latex allergy\") or a general or categorical negated statement (e.g., \"No known allergy\", \"No known drug allergies\"). Note: the substance for a specific reaction may be different from the substance identified as the cause of the risk, but it must be consistent with it. For instance, it may be a more specific substance (e.g. a brand medication) or a composite product that includes the identified substance. It must be clinically safe to only process the 'code' and ignore the 'reaction.substance'. If a receiving system is unable to confirm that AllergyIntolerance.reaction.substance falls within the semantic scope of AllergyIntolerance.code, then the receiving system should ignore AllergyIntolerance.reaction.substance.　\r\n\r\nアレルギーまたは不寛容の記録（肯定的または否定的/除外されたという記録のいずれか）のコード。これは、有害反応のリスク（「ラテックス」など）、アレルギーまたは不耐性状態（「ラテックスアレルギー」など）、または否定/除外されたコードの原因であると考えられる物質または医薬品のコードである可能性がある。\r\n\r\n\r\n特定の物質またはクラス（例：「ラテックスアレルギーなし」）または一般的またはカテゴリ別の否定的な記述（例：「既知のアレルギーなし」、「既知の薬物アレルギーなし」）。\r\n\r\n注：特定の反応の物質は、リスクの原因として特定された物質とは異なる場合があるが、それと一致している必要がある。たとえば、より具体的な物質（ブランド薬など）や、特定された物質を含む複合製品の場合がある。\r\n「コード」のみを処理し、「reaction.substance」を無視しても、臨床的に安全でなければならない。\r\n受信システムがAllergyIntolerance.reaction.substanceがAllergyIntolerance.codeのセマンティックスコープ内にあること（前者が後者の意味的な下位概念にあること）を確認できない場合、受信システムはAllergyIntolerance.reaction.substanceを無視する必要がある。",
        "min": 1,
        "mustSupport": false
      },
      {
        "id": "AllergyIntolerance.code.coding.system",
        "path": "AllergyIntolerance.code.coding.system",
        "fixedUri": "http://jpfhir.jp/fhir/Common/CodeSystem/allergyintolerance-code"
      },
      {
        "id": "AllergyIntolerance.patient",
        "path": "AllergyIntolerance.patient",
        "short": "この情報が誰の患者のものかを示すため、その患者リソースへの参照",
        "definition": "The patient who has the allergy or intolerance.\r\n\r\nこのアレルギーまたは不耐性のある患者。",
        "comment": "参照は、実際のFHIRリソースへの参照である必要があり、解決可能（内容に到達可能）である必要がある（アクセス制御、一時的な使用不可などを考慮に入れる）。解決は、URLから取得するか、リソースタイプによって該当する場合は、絶対参照を正規URLとして扱い、ローカルレジストリ/リポジトリで検索することによって行うことができる。",
        "mustSupport": false
      },
      {
        "id": "AllergyIntolerance.encounter",
        "path": "AllergyIntolerance.encounter",
        "short": "Encounter when the allergy or intolerance was asserted　このアレルギーまたは不耐性がわかったときの受診Encounter情報",
        "definition": "The encounter when the allergy or intolerance was asserted.\r\nこのアレルギーまたは不耐性がわかったときの受診Encounter情報",
        "comment": "References SHALL be a reference to an actual FHIR resource, and SHALL be resolveable (allowing for access control, temporary unavailability, etc.). Resolution can be either by retrieval from the URL, or, where applicable by resource type, by treating an absolute reference as a canonical URL and looking it up in a local registry/repository.\r\n\r\n参照は、実際のFHIRリソースへの参照である必要があり、解決可能（内容に到達可能）である必要がある（アクセス制御、一時的な使用不可などを考慮に入れる）。解決は、URLから取得するか、リソースタイプによって該当する場合は、絶対参照を正規URLとして扱い、ローカルレジストリ/リポジトリで検索することによって行うことができる。"
      },
      {
        "id": "AllergyIntolerance.onset[x]",
        "path": "AllergyIntolerance.onset[x]",
        "short": "When allergy or intolerance was identified　アレルギーや不耐性が同定された時期",
        "definition": "Estimated or actual date,  date-time, or age when allergy or intolerance was identified.\r\n\r\nアレルギーや不耐性が同定された推定時期または実際の時期で、日付、日時、年齢"
      },
      {
        "id": "AllergyIntolerance.recordedDate",
        "path": "AllergyIntolerance.recordedDate",
        "short": "Date first version of the resource instance was recorded　このリソースインスタンスの最初の版が記録された日付",
        "definition": "The recordedDate represents when this particular AllergyIntolerance record was created in the system, which is often a system-generated date.\r\n\r\nこの要素は、特定のこのAllergyIntolerance レコードがシステムに作成された時期を示し、たいていはシステムが生成した日付。"
      },
      {
        "id": "AllergyIntolerance.recorder",
        "path": "AllergyIntolerance.recorder",
        "short": "Who recorded the sensitivity　この感受性をっ記録した人",
        "definition": "Individual who recorded the record and takes responsibility for its content.\r\n\r\nこのレコードを記録し、その内容に責任を持つ個人。",
        "comment": "References SHALL be a reference to an actual FHIR resource, and SHALL be resolveable (allowing for access control, temporary unavailability, etc.). Resolution can be either by retrieval from the URL, or, where applicable by resource type, by treating an absolute reference as a canonical URL and looking it up in a local registry/repository.\r\n\r\n参照は、実際のFHIRリソースへの参照である必要があり、解決可能（内容に到達可能）である必要がある（アクセス制御、一時的な使用不可などを考慮に入れる）。解決は、URLから取得するか、リソースタイプによって該当する場合は、絶対参照を正規URLとして扱い、ローカルレジストリ/リポジトリで検索することによって行うことができる。"
      },
      {
        "id": "AllergyIntolerance.asserter",
        "path": "AllergyIntolerance.asserter",
        "short": "Source of the information about the allergy　アレルギーに関する情報の発生または取得元",
        "definition": "The source of the information about the allergy that is recorded.\r\n\r\nアレルギーに関する情報の発生または取得元",
        "comment": "The recorder takes responsibility for the content, but can reference the source from where they got it.\r\n\r\n recorderは内容に責任を持つのに対して、これはどこからその情報を取得したかについての情報。"
      },
      {
        "id": "AllergyIntolerance.lastOccurrence",
        "path": "AllergyIntolerance.lastOccurrence",
        "short": "Date(/time) of last known occurrence of a reaction　反応が一番直近（最後）に発生したとわかっている日付（日時）",
        "definition": "Represents the date and/or time of the last known occurrence of a reaction event.\r\n\r\n反応イベントが一番直近（最後）に発生したとわかっている日付（日時）を表す。",
        "comment": "This date may be replicated by one of the Onset of Reaction dates. Where a textual representation of the date of last occurrence is required e.g. 'In Childhood, '10 years ago' the Comment element should be used.\r\n\r\nこの日付は、初めて反応があった複数の日のいずれかによって複製されるてもよい。最後に発生した日付のテキスト表現が必要な場合（例： 「子供の頃、「10年前」」コメント要素を使用する必要がある。"
      },
      {
        "id": "AllergyIntolerance.note",
        "path": "AllergyIntolerance.note",
        "short": "Additional text not captured in other fields　他のフィールド要素では記述できない追加テキスト",
        "definition": "Additional narrative about the propensity for the Adverse Reaction, not captured in other fields.\r\n\r\n他のフィールド要素では記述（取得）できない、副反応に関する傾向に関する追加的な叙述テキスト",
        "comment": "For example: including reason for flagging a seriousness of 'High Risk'; and instructions related to future exposure or administration of the substance, such as administration within an Intensive Care Unit or under corticosteroid cover. The notes should be related to an allergy or intolerance as a condition in general and not related to any particular episode of it. For episode notes and descriptions, use AllergyIntolerance.event.description and  AllergyIntolerance.event.notes.\r\n\r\n例：「高リスク」の重大度にフラグを立てる理由を含めたり、集中治療室内またはコルチコステロイド治療の下での投与など、薬剤の将来の曝露または投与に関連する指示などを含める。note要素は、一般的な状態としてのアレルギーや不耐性に関連した情報を記述するためのもので、その特定のエピソードに関連した情報の記述には使わないこと。特定のエピソードのメモや説明については、AllergyIntolerance.event.descriptionとAllergyIntolerance.event.notesを使用すること。"
      },
      {
        "id": "AllergyIntolerance.reaction",
        "path": "AllergyIntolerance.reaction",
        "short": "Adverse Reaction Events linked to exposure to substance　物質への暴露に関連する有害反応事象",
        "definition": "Details about each adverse reaction event linked to exposure to the identified substance.\r\n\r\n同定された物質への暴露に関連する個々の有害反応イベントに関する詳細情報。",
        "mustSupport": false
      },
      {
        "id": "AllergyIntolerance.reaction.substance",
        "path": "AllergyIntolerance.reaction.substance",
        "short": "Specific substance or pharmaceutical product considered to be responsible for event　イベントの原因と考えられる特定の物質または医薬品",
        "definition": "Identification of the specific substance (or pharmaceutical product) considered to be responsible for the Adverse Reaction event. Note: the substance for a specific reaction may be different from the substance identified as the cause of the risk, but it must be consistent with it. For instance, it may be a more specific substance (e.g. a brand medication) or a composite product that includes the identified substance. It must be clinically safe to only process the 'code' and ignore the 'reaction.substance'.  If a receiving system is unable to confirm that AllergyIntolerance.reaction.substance falls within the semantic scope of AllergyIntolerance.code, then the receiving system should ignore AllergyIntolerance.reaction.substance.\r\n副作用の原因と考えられる特定の物質（または医薬品）の特定。\r\n注：特定の反応の物質は、リスクの原因として特定された物質とは異なる場合があるが、それと一致している必要がある。たとえば、より具体的な物質（ブランド薬など）や、特定された物質を含む複合製品の場合がある。 「コード」のみを処理し、「reaction.substance」を無視しても臨床的に安全でなければならない。受信システムがAllergyIntolerance.reaction.substanceがAllergyIntolerance.codeのセマンティックスコープ内にあること（つまり意味的に親子関係、包含される関係）を確認できない（確認できる機能を持たない）場合、受信システムはAllergyIntolerance.reaction.substanceを無視する必要がある。",
        "comment": "Coding of the specific substance (or pharmaceutical product) with a terminology capable of triggering decision support should be used wherever possible.  The 'code' element allows for the use of a specific substance or pharmaceutical product, or a group or class of substances. In the case of an allergy or intolerance to a class of substances, (for example, \"penicillins\"), the 'reaction.substance' element could be used to code the specific substance that was identified as having caused the reaction (for example, \"amoxycillin\"). Duplication of the value in the 'code' and 'reaction.substance' elements is acceptable when a specific substance has been recorded in 'code'.\r\n意思決定支援機能を開始するきっかけとなるような、ターミノロジーを使用した特定の物質（または医薬品）のコーディングを、可能な限り使用する必要がある。 「コード」要素は、特定の物質または医薬品、あるいは物質のグループまたはクラスの使用を可能にする。あるクラスの物質（たとえば、「ペニシリン」）に対するアレルギーまたは不耐性の場合、「reaction.substance」要素を使用して、反応を引き起こしたと特定された特定の物質をコード化できる（たとえば、 「アモキシシリン」）。 「code」および「reaction.substance」要素の値の重複は、特定の物質が「code」に記録されている場合には許容される。"
      },
      {
        "id": "AllergyIntolerance.reaction.manifestation",
        "path": "AllergyIntolerance.reaction.manifestation",
        "short": "Clinical symptoms/signs associated with the Event　事象（イベント）に関連した臨床的症状や兆候",
        "definition": "Clinical symptoms and/or signs that are observed or associated with the adverse reaction event.\r\n有害反応事象に関連した臨床的な症状や兆候。",
        "comment": "Manifestation can be expressed as a single word, phrase or brief description. For example: nausea, rash or no reaction. It is preferable that manifestation should be coded with a terminology, where possible. The values entered here may be used to display on an application screen as part of a list of adverse reactions, as recommended in the UK NHS CUI guidelines.  Terminologies commonly used include, but are not limited to, SNOMED CT or ICD10.\r\n\r\n症状は、単一の単語、フレーズ、または簡単な説明で表現できる。例：吐き気、発疹、反応なし。可能であれば、症状をターミノロジーを使ってコーディングすることが望ましい。ここに入力された値は、英国NHS CUIガイドラインで推奨されているように、副作用のリストの一部としてアプリケーション画面に表示するために使用される場合がある。一般的に使用される用語には、SNOMED CTまたはICD10が含まれるが、これらに限定されない。",
        "mustSupport": false
      },
      {
        "id": "AllergyIntolerance.reaction.description",
        "path": "AllergyIntolerance.reaction.description",
        "short": "Description of the event as a whole　事象の全体的な記述",
        "definition": "Text description about the reaction as a whole, including details of the manifestation if required.\r\n必要なら症状兆候の詳細も含めた、反応事象に関する全体としてはテキスト記述。",
        "comment": "Use the description to provide any details of a particular event of the occurred reaction such as circumstances, reaction specifics, what happened before/after. Information, related to the event, but not describing a particular care should be captured in the comment field. For example: at the age of four, the patient was given penicillin for strep throat and subsequently developed severe hives.\r\n\r\nこの要素を使用して、状況、反応の詳細、前後に何が起こったかなど、発生した反応の特定のイベントの詳細を提供できる。イベントに関連しているが、特定の治療的対応を記述しない情報は、コメントフィールドに取り込む必要がある。\r\n例：4歳のとき、患者は連鎖球菌性咽頭炎のためにペニシリンを投与され、その後重度のじんましんを発症しました。"
      },
      {
        "id": "AllergyIntolerance.reaction.onset",
        "path": "AllergyIntolerance.reaction.onset",
        "short": "Date(/time) when manifestations showed　症状所見がみられた日付（日時）",
        "definition": "Record of the date and/or time of the onset of the Reaction.\r\n反応の開始の日付か日時の記録。"
      },
      {
        "id": "AllergyIntolerance.reaction.severity",
        "path": "AllergyIntolerance.reaction.severity",
        "definition": "Clinical assessment of the severity of the reaction event as a whole, potentially considering multiple different manifestations.\r\n反応事象の重症度の全体としての臨床的な評価で、潜在的には複数の異なる症状兆候を考慮して決める。",
        "comment": "It is acknowledged that this assessment is very subjective. There may be some specific practice domains where objective scales have been applied. Objective scales can be included in this model as extensions.\r\nこの評価は非常に主観的なものであることが認められている。客観的な尺度が適用されている特定の実践領域がいくつかあるかもしれない。客観的なスケールは、このモデルに拡張Extensionとして記述できる。"
      },
      {
        "id": "AllergyIntolerance.reaction.exposureRoute",
        "path": "AllergyIntolerance.reaction.exposureRoute",
        "short": "How the subject was exposed to the substance　対象者（患者）がどのように物質に暴露したか。",
        "definition": "Identification of the route by which the subject was exposed to the substance.\r\n対象者（患者）がどにょうな経路でその物質に暴露したかの同定。",
        "comment": "Coding of the route of exposure with a terminology should be used wherever possible.\r\n可能であれば必ずターミノロジーを使って暴露経路をコーディングすること。"
      },
      {
        "id": "AllergyIntolerance.reaction.note",
        "path": "AllergyIntolerance.reaction.note",
        "short": "Text about event not captured in other fields　他のフィールド要素では記述できない追加テキスト",
        "definition": "Additional text about the adverse reaction event not captured in other fields.\r\n他のフィールド要素では記述（取得）できない、副反応に関する傾向に関する追加的な叙述テキスト",
        "comment": "Use this field to record information indirectly related to a particular event and not captured in the description. For example: Clinical records are no longer available, recorded based on information provided to the patient by her mother and her mother is deceased.\r\n\r\nこのフィールドを使用して、特定のイベントに間接的に関連し、descriptionに記述されていない情報を記録する。\r\n例：母親から患者に提供された情報に基づいて記録された臨床記録は利用できなくなり、母親は亡くなった。"
      }
    ]
  }
}