{
  "resourceType": "StructureDefinition",
  "url": "http://jpfhir.jp/fhir/core/StructureDefinition/JP_Condition",
  "version": "1.0.0",
  "name": "JP_Condition",
  "status": "active",
  "date": "2021-12-03T06:07:58.0495934+00:00",
  "description": "本プロファイルはConditionリソースに対して、患者の健康状態に関するデータを送受信するための共通の制約と拡張を定めたものである。",
  "fhirVersion": "4.0.1",
  "mapping": [
    {
      "identity": "workflow",
      "uri": "http://hl7.org/fhir/workflow",
      "name": "Workflow Pattern"
    },
    {
      "identity": "sct-concept",
      "uri": "http://snomed.info/conceptdomain",
      "name": "SNOMED CT Concept Domain Binding"
    },
    {
      "identity": "v2",
      "uri": "http://hl7.org/v2",
      "name": "HL7 v2 Mapping"
    },
    {
      "identity": "rim",
      "uri": "http://hl7.org/v3",
      "name": "RIM Mapping"
    },
    {
      "identity": "w5",
      "uri": "http://hl7.org/fhir/fivews",
      "name": "FiveWs Pattern Mapping"
    },
    {
      "identity": "sct-attr",
      "uri": "http://snomed.org/attributebinding",
      "name": "SNOMED CT Attribute Binding"
    }
  ],
  "kind": "resource",
  "abstract": false,
  "type": "Condition",
  "baseDefinition": "http://hl7.org/fhir/StructureDefinition/Condition",
  "derivation": "constraint",
  "differential": {
    "element": [
      {
        "id": "Condition",
        "path": "Condition",
        "short": "Detailed information about conditions, problems or diagnoses 身体的状態、問題、診断に関する詳細情報",
        "definition": "A clinical condition, problem, diagnosis, or other event, situation, issue, or clinical concept that has risen to a level of concern.\r\n\r\n患者の健康上の懸念となるレベルに達した、身体的、精神的、社会的な負の状態(conditon)や問題（problem／issue）、医療者による診断(diagnosis)、生じたイベント(event)、置かれている状況(situation)、臨床医学的概念(clinical concept)を表現する。"
      },
      {
        "id": "Condition.identifier",
        "path": "Condition.identifier",
        "definition": "Business identifiers assigned to this condition by the performer or other systems which remain constant as the resource is updated and propagates from server to server.\r\n\r\n実行者または他のシステムによってこの条件に割り当てられたビジネス識別子。リソースが更新され、サーバーからサーバーに伝送されるときにも変化しない。",
        "comment": "This is a business identifier, not a resource identifier (see [discussion](resource.html#identifiers)).  It is best practice for the identifier to only appear on a single resource instance, however business practices may occasionally dictate that multiple resource instances with the same identifier can exist - possibly even with different resource types.  For example, multiple Patient and a Person resource instance might share the same social insurance number.\r\n\r\nこれはビジネス識別子であり、リソース識別子ではない。全インスタンスを通して識別子は単一インスタンスを指し示すことがベストである。しかし、異なるリソースタイプの複数のリソースインスタンスに同じ識別子を割り当てることも稀にはある。例えば、重複するPatientリソースインスタンスとPersonリソースインスタンスは同じソーシャルセキュリティー番号を共有することなどである。"
      },
      {
        "id": "Condition.clinicalStatus",
        "path": "Condition.clinicalStatus",
        "definition": "The clinical status of the condition.\r\n\r\n臨床的状態のステータス（アクティブか否かなど）。",
        "comment": "The data type is CodeableConcept because clinicalStatus has some clinical judgment involved, such that there might need to be more specificity than the required FHIR value set allows. For example, a SNOMED coding might allow for additional specificity.\r\n\r\n【JP-CORE】\r\ncodeとしてhttp://terminology.hl7.org/CodeSystem/condition-clinicalでは\r\nLv0 active: 状態による症状が現在継続している、または状態を裏付ける所見などが存在していることを指す。\r\nLv1 recurrence: 過去に一回解消した問題が再発していることを指す。\r\nLv1 relapse: 過去に改善または寛解を得た状態が再度悪化していることを指す。\r\nLv0 inactive: 状態による症状が現在存在していない、または状態を裏付ける所見などが存在していないことを指す。\r\nLv1 remission: 状態による症状が現在存在していないが、再発のリスクを有している場合を指す。\r\nLv1 resolved: 状態による症状が現在存在していおらず、再発のリスクを考慮する必要がない場合を指す。\r\n上記が入力されるが、JP-COREでは保険病名の表現を可能とするため、上記情報に加え下記を表現可能とするか否か検討のひつようがある。別個にclinicaloutcomeを作成する検討の必要性がある。\r\n退院時転帰\r\n1 =資源病名が治癒したと判断される場合\r\n2 =資源病名が軽快したと判断される場合\r\n3 =資源病名が寛解したと判断される場合\r\n4 =資源病名が不変と判断される場合\r\n5 =資源病名が増悪したと判断される場合\r\n6 =資源病名による死亡\r\n7 =資源病名以外による死亡\r\n9 =その他(検査入院含む)",
        "mustSupport": false
      },
      {
        "id": "Condition.verificationStatus",
        "path": "Condition.verificationStatus",
        "definition": "The verification status to support the clinical status of the condition.\r\n\r\nclinicalStatus の確からしさ。",
        "comment": "verificationStatus is not required.  For example, when a patient has abdominal pain in the ED, there is not likely going to be a verification status.\nThe data type is CodeableConcept because verificationStatus has some clinical judgment involved, such that there might need to be more specificity than the required FHIR value set allows. For example, a SNOMED coding might allow for additional specificity.\r\n\r\n【JP-CORE】\r\ncodeとしてhttp://terminology.hl7.org/CodeSystem/condition-ver-statusを用い、具体的には\r\nLv0 unconfirmed: 該当する状態の存在を確定とは言い切れないことを示す。\r\nLv1 provisional: 該当する状態の存在は暫定的であることを示す。\r\nLv1 differential: 該当する状態を鑑別するべき意図で記載されたことを示す。\r\nLv0 confirmed: 該当する状態は十分な根拠によって確定されたものであることを示す。\r\nLv0 refuted: 該当する状態は十分な根拠によって除外されたものであることを示す。\r\nLv0 entered-in-error: 有効でない入力であることを示す。\r\n上記が入力される。",
        "mustSupport": false
      },
      {
        "id": "Condition.category",
        "path": "Condition.category",
        "short": "problem-list-item | encounter-diagnosis | health-concern",
        "definition": "A category assigned to the condition.\r\n\r\n本状態のカテゴリ。プロブレムリスト項目、受診時診断、健康問題、など。",
        "comment": "The categorization is often highly contextual and may appear poorly differentiated or not very useful in other contexts.\r\n\r\nカテゴリー情報は多くの場合、高度にコンテキストに依存しているので、他のコンテキストでは十分にカテゴリーとして区分されていないか、あまり役に立たないように見える場合がある。\r\n\r\n【JP-CORE】\r\nencounter diagnosisの概念を残すかどうかについて検討の余地がある。\r\n[案1]\r\ncodeとしてhttp://terminology.hl7.org/CodeSystem/condition-categoryを参考にするが、保険登録病名として反映可能かどうかの情報を含める。具体的には、\r\nproblem-list-item-available-as-claim-diagnosis: 時間的な幅をもってプロブレムリストの一つとして扱われているもののうち、保険病名として反映すべきものを示す。\r\nproblem-list-item-unavailable-as-claim-diagnosis: 時間的な幅をもってプロブレムリストの一つとして扱われているもののうち、保険病名として反映すべきでないものを示す。\r\nencounter-diagnosis-available-as-claim-diagnosis: 時間的な幅を持たず瞬間的な判断根拠によって示された状態表現のうち、保険病名として反映すべきものを示す。\r\nencounter-diagnosis: 時間的な幅を持たず瞬間的な判断根拠によって示された状態表現のうち、保険病名として反映すべきでないものを示す。\r\n上記が入力される。\r\n[案2]\r\n保険登録病名として反映可能かどうかの情報のみを示す。具体的には、\r\navailable-as-claim-diagnosis: 保険病名として反映すべきものを示す。\r\nunavailable-as-claim-diagnosis: 保険病名として反映すべきでないものを示す。\r\n上記が入力される。\r\n\r\n＊US Coreに倣い、problem-list-item | encounter-diagnosis | health-concernとしている。カーディナリティを1..1としているため、このいずれかが入力されることになるため要検討です。",
        "min": 1,
        "mustSupport": false
      },
      {
        "id": "Condition.severity",
        "path": "Condition.severity",
        "short": "Subjective severity of condition　状態の主観的な重症度",
        "definition": "A subjective assessment of the severity of the condition as evaluated by the clinician.\r\n\r\n医師によって評価された本状態の主観的な重症度。",
        "comment": "Coding of the severity with a terminology is preferred, where possible.\r\n可能な限り、ターミノロジーを用いて重症度をコーディングすること。\r\n\r\n【JP-CORE】\r\ncodeとしてhttp://snomed.info/sctに定義された下記が用いられる。\r\ncode:24484000 Display:Severe\r\ncode:6736007 Display:Moderate\r\ncode:255604002 Display:Mild"
      },
      {
        "id": "Condition.code",
        "path": "Condition.code",
        "short": "Identification of the condition, problem or diagnosis　状態、問題、診断の識別情報",
        "definition": "Identification of the condition, problem or diagnosis.\r\n本状態の種類を表すコード。",
        "comment": "Not all terminology uses fit this general pattern. In some cases, models should not use CodeableConcept and use Coding directly and provide their own structure for managing text, codings, translations and the relationship between elements and pre- and post-coordination.\r\n\r\nすべてのターミノロジーの使用がこの一般的なパターンに適合するわけではない。場合によっては、モデルはCodeableConceptを使用せず、コーディングを直接使用して、テキスト、コーディング、翻訳、および要素間の関係とpre-coordinationとpost-coordinationの用語関係を管理するための独自の構造を提供する必要がある。\r\n\r\n【JP-CORE】\r\n＊value-setに下記も含める前提として、カーディナリティを1..1としている\r\nsct:160245001  No current problems or disability\r\nsct:3219008  Disease type AND/OR category unknown",
        "min": 1,
        "mustSupport": false
      },
      {
        "id": "Condition.bodySite",
        "path": "Condition.bodySite",
        "short": "Anatomical location, if relevant　もし関連しているのがあれば人体部位",
        "definition": "The anatomical location where this condition manifests itself.\r\n\r\n本状態が存在する人体部位。",
        "comment": "Only used if not implicit in code found in Condition.code. If the use case requires attributes from the BodySite resource (e.g. to identify and track separately) then use the standard extension [bodySite](extension-bodysite.html).  May be a summary code, or a reference to a very precise definition of the location, or both.\r\n\r\nCondition.codeにあるコードでは暗黙的に部位が不明な場合にのみ使用する。BodySiteリソースの属性が必要な場合（たとえば、個別に部位を識別して追跡するため）、標準の拡張extension[bodySite]（extension-bodysite.html）を使用する。要約したコード（ある程度抽象化された部位を示すコードの意）、または非常に正確な場所の定義への参照、あるいはその両方である可能性がある。\r\n\r\n【例】\r\ncodeとしてhttp://snomed.info/sctに定義された 442083009 (Anatomical or acquired body structure)が用いられる。\r\n例\r\ncode:344001 Display:Ankle\r\ncode:955009 Display:Bronchus"
      },
      {
        "id": "Condition.subject",
        "path": "Condition.subject",
        "short": "Who has the condition?　誰がこの状態の人か",
        "definition": "Indicates the patient or group who the condition record is associated with.\r\n\r\n本状態に関連付けられる患者やグループ。",
        "comment": "References SHALL be a reference to an actual FHIR resource, and SHALL be resolveable (allowing for access control, temporary unavailability, etc.). Resolution can be either by retrieval from the URL, or, where applicable by resource type, by treating an absolute reference as a canonical URL and looking it up in a local registry/repository.\r\n\r\n参照は、実際のFHIRリソースへの参照である必要があり、解決可能（内容に到達可能）である必要がある（アクセス制御、一時的な使用不可などを考慮に入れる）。解決は、URLから取得するか、リソースタイプによって該当する場合は、絶対参照を正規URLとして扱い、ローカルレジストリ/リポジトリで検索することによって行うことができる。\r\n\r\n【JP-CORE】\r\n必須(Cardinality 1...1)とする。",
        "mustSupport": false
      },
      {
        "id": "Condition.encounter",
        "path": "Condition.encounter",
        "short": "Encounter created as part of　受診詳細情報",
        "definition": "The Encounter during which this Condition was created or to which the creation of this record is tightly associated.\r\n\r\n本状態が記録されたり、このレコードの作成と密接に関連づけられる受診詳細情報。",
        "comment": "This will typically be the encounter the event occurred within, but some activities may be initiated prior to or after the official completion of an encounter but still be tied to the context of the encounter. This record indicates the encounter this particular record is associated with.  In the case of a \"new\" diagnosis reflecting ongoing/revised information about the condition, this might be distinct from the first encounter in which the underlying condition was first \"known\".\r\n\r\nこれは通常、イベントが発生したエンカウンターですが、場合によっては病状状態は、エンカウンターが完了する前または後に開始されているる場合がある。それでもエンカウンターのコンテキストに関連付けられる。このレコードは、この特定のレコードが関連付けられているエンカウンターを示す。状態に関する進行中/新しい情報を反映した「新しい」診断の場合には、それまでに存在していた状態がはじめて「知られた」最初のエンカウンターとは異なる可能性がある。\r\n\r\n【JP仕様】\r\n入院外来の区別や所在場所、担当診療科の情報に使用する。付加的な情報であり、1...1には制約しない。"
      },
      {
        "id": "Condition.onset[x]",
        "path": "Condition.onset[x]",
        "short": "Estimated or actual date,  date-time, or age　推定される、または実際に始まった日付または日時または年齢",
        "definition": "Estimated or actual date or date-time  the condition began, in the opinion of the clinician.\r\n\r\n臨床医の判断における、本状態が始まったと推定される、または実際に始まった日付または日時。",
        "comment": "Age is generally used when the patient reports an age at which the Condition began to occur.\r\n\r\n年齢は一般的に、患者が症状が発生し始めた年齢を報告したケースで使用される。"
      },
      {
        "id": "Condition.abatement[x]",
        "path": "Condition.abatement[x]",
        "short": "When in resolution/remission　治癒（解決）または寛解した時期",
        "definition": "The date or estimated date that the condition resolved or went into remission. This is called \"abatement\" because of the many overloaded connotations associated with \"remission\" or \"resolution\" - Conditions are never really resolved, but they can abate.\r\n\r\n状態が解決した、または寛解した日付または推定日。これは、「寛解」または「治癒（解決）」のどちらかを使うには意味が重すぎることから「軽快」と呼ばれる-状態は実際には治癒していないが、軽快にすることはできる。",
        "comment": "There is no explicit distinction between resolution and remission because in many cases the distinction is not clear. Age is generally used when the patient reports an age at which the Condition abated.  If there is no abatement element, it is unknown whether the condition has resolved or entered remission; applications and users should generally assume that the condition is still valid.  When abatementString exists, it implies the condition is abated.\r\n\r\n多くの場合、解決と寛解の間に明確な区別はない。年齢は一般的に、患者が状態が緩和した年齢を報告するケースで使用される。軽快要素がない場合、状態が解決したか、寛解に入ったかは不明である。アプリケーションとユーザーは通常、状態がまだ有効であると想定する必要があ。 abatementStringが存在する場合、それは状態が軽快されることを意味する。"
      },
      {
        "id": "Condition.recordedDate",
        "path": "Condition.recordedDate",
        "short": "Date record was first recorded　記録が最初に記録された日付",
        "definition": "The recordedDate represents when this particular Condition record was created in the system, which is often a system-generated date.\r\n\r\nレコードがシステムで作成された日時。多くの場合、システムで生成された日付。"
      },
      {
        "id": "Condition.recorder",
        "path": "Condition.recorder",
        "short": "Who recorded the condition　この状態を記録した人",
        "definition": "Individual who recorded the record and takes responsibility for its content.\r\n\r\n本記録を記録し、その内容に責任を負う個人。",
        "comment": "References SHALL be a reference to an actual FHIR resource, and SHALL be resolveable (allowing for access control, temporary unavailability, etc.). Resolution can be either by retrieval from the URL, or, where applicable by resource type, by treating an absolute reference as a canonical URL and looking it up in a local registry/repository.\r\n\r\n参照は、実際のFHIRリソースへの参照である必要があり、解決可能（内容に到達可能）である必要がある（アクセス制御、一時的な使用不可などを考慮に入れる）。解決は、URLから取得するか、リソースタイプによって該当する場合は、絶対参照を正規URLとして扱い、ローカルレジストリ/リポジトリで検索することによって行うことができる。\r\n\r\n【JP-CORE】\r\nFHIR規定仕様においてCardinalityで0を許容しているのは記載内容の責任者と記録者が異なるケースを想定していると考えられるが、現状の診療で一般的に行われるカルテ記載形式を考慮し、Cardinality 1...1を検討するべきとも考えれるため、基本的には本要素には値を設定する。"
      },
      {
        "id": "Condition.asserter",
        "path": "Condition.asserter",
        "short": "Person who asserts this condition　この状態があるというした人",
        "definition": "Individual who is making the condition statement.\r\n\r\n本状態があるという事実を作成した個人。",
        "comment": "References SHALL be a reference to an actual FHIR resource, and SHALL be resolveable (allowing for access control, temporary unavailability, etc.). Resolution can be either by retrieval from the URL, or, where applicable by resource type, by treating an absolute reference as a canonical URL and looking it up in a local registry/repository.\r\n\r\n参照は、実際のFHIRリソースへの参照である必要があり、解決可能（内容に到達可能）である必要がある（アクセス制御、一時的な使用不可などを考慮に入れる）。解決は、URLから取得するか、リソースタイプによって該当する場合は、絶対参照を正規URLとして扱い、ローカルレジストリ/リポジトリで検索することによって行うことができる。\r\n\r\n【JP-CORE】\r\n通常の診療では判断した個人と記載した個人は同一であるケースが一般的であり、既存の情報の転記などの際に、記載者と状態の存在を判断した個人が異なる場合に記入が必要となると考えられる。"
      },
      {
        "id": "Condition.stage",
        "path": "Condition.stage",
        "short": "Stage/grade, usually assessed formally　ステージやグレードで、普通は正式に評価されたもの。",
        "definition": "Clinical stage or grade of a condition. May include formal severity assessments.\r\n\r\n病状の臨床病期またはグレード。正式な重症度評価が含まれる場合がある。"
      },
      {
        "id": "Condition.evidence",
        "path": "Condition.evidence",
        "short": "Supporting evidence　事実の支持する証拠",
        "definition": "Supporting evidence / manifestations that are the basis of the Condition's verification status, such as evidence that confirmed or refuted the condition.\r\n\r\n状態を確認または反駁した証拠など、状態の検証ステータスの基礎となる裏付けとなる証拠/兆候。",
        "comment": "The evidence may be a simple list of coded symptoms/manifestations, or references to observations or formal assessments, or both.\r\n\r\nエビデンスは、コード化された症状/症状の単純なリスト、または観察または正式な評価への参照、あるいはその両方である可能性がある。\r\n\r\n【仕様例】\r\ncodeとしてhttp://snomed.info/sctに定義された 404684003 (Clinical finding)が用いられる。\r\n例\r\ncode:1735007 Display:Thrill"
      },
      {
        "id": "Condition.note",
        "path": "Condition.note",
        "short": "Additional information about the Condition　状態に関する追加情報",
        "definition": "Additional information about the Condition. This is a general notes/comments entry  for description of the Condition, its diagnosis and prognosis.\r\n態に関する追加情報。これは、状態、その診断および予後の説明のための一般的なメモ/コメントエントリ。",
        "comment": "For systems that do not have structured annotations, they can simply communicate a single annotation with no author or time.  This element may need to be included in narrative because of the potential for modifying information.  *Annotations SHOULD NOT* be used to communicate \"modifying\" information that could be computable. (This is a SHOULD because enforcing user behavior is nearly impossible).\r\n\r\n構造化された注釈（アノテーション）を持たないシステムの場合、作成者や時間なしで単一の注釈を簡単に伝達できる。情報を変更する可能性があるため、この要素をナラティブに含める必要がある場合がある。 \r\n*注釈は、計算機処理れきる「変更」情報を伝達するために使用されるべきではない*。 （ユーザーの行動を強制することはほとんど不可能であるため、これはSHOULDである）。"
      }
    ]
  }
}