{
  "resourceType": "StructureDefinition",
  "url": "http://jpfhir.jp/fhir/core/StructureDefinition/JP_Location",
  "version": "1.0.0",
  "name": "JP_Location",
  "status": "active",
  "date": "2020-09-15T06:54:22.4695992+00:00",
  "description": "このプロファイルはLocationリソースに対して、所在場所のデータを送受信するための基礎となる制約と拡張を定めたものである。",
  "fhirVersion": "4.0.1",
  "mapping": [
    {
      "identity": "rim",
      "uri": "http://hl7.org/v3",
      "name": "RIM Mapping"
    },
    {
      "identity": "w5",
      "uri": "http://hl7.org/fhir/fivews",
      "name": "FiveWs Pattern Mapping"
    }
  ],
  "kind": "resource",
  "abstract": false,
  "type": "Location",
  "baseDefinition": "http://hl7.org/fhir/StructureDefinition/Location",
  "derivation": "constraint",
  "differential": {
    "element": [
      {
        "id": "Location",
        "path": "Location",
        "short": "物理的な場所の詳細情報と位置情報",
        "definition": "Details and position information for a physical place where services are provided and resources and participants may be stored, found, contained, or accommodated.\r\n\r\nサービスが提供され、リソースとそれに関わる人たちが存在する物理的な場所の詳細情報と位置情報。"
      },
      {
        "id": "Location.identifier",
        "path": "Location.identifier",
        "short": "Unique code or number identifying the location to its users / ユーザーに場所を特定する一意のコードまたは番号",
        "definition": "Unique code or number identifying the location to its users.\r\n\r\nユーザーに場所を特定する一意のコードまたは番号",
        "requirements": "Organization label locations in registries, need to keep track of those.\r\n\r\n\r\n登記内の組織ラベルの場所。これらを追跡する必要があります。"
      },
      {
        "id": "Location.status",
        "path": "Location.status",
        "short": "active | suspended | inactive / アクティブ|中断|非アクティブ",
        "definition": "The status property covers the general availability of the resource, not the current value which may be covered by the operationStatus, or by a schedule/slots if they are configured for the location.\r\n\r\nstatusプロパティは、operationStatus、またはロケーションに構成されている場合はスケジュール/スロットによってカバーされる可能性がある現在の値ではなく、リソースの一般的な可用性をカバーします。",
        "comment": "Note that FHIR strings SHALL NOT exceed 1MB in size\r\n\r\n\r\nFHIR文字列はサイズが1MBを超えてはならないことに注意してください"
      },
      {
        "id": "Location.operationalStatus",
        "path": "Location.operationalStatus",
        "short": "The operational status of the location (typically only for a bed/room) / ロケーションの運用ステータス（通常、ベッド/部屋のみ）",
        "definition": "The operational status covers operation values most relevant to beds (but can also apply to rooms/units/chairs/etc. such as an isolation unit/dialysis chair). This typically covers concepts such as contamination, housekeeping, and other activities like maintenance.\r\n\r\n稼働状況には、ベッドに最も関連する稼働値が含まれます（ただし、隔離ユニット/透析椅子などの部屋/ユニット/椅子などにも適用できます）。これは通常、汚染、ハウスキーピング、およびメンテナンスなどの他のアクティビティなどの概念をカバーしています。",
        "comment": "Codes may be defined very casually in enumerations or code lists, up to very formal definitions such as SNOMED CT - see the HL7 v3 Core Principles for more information.\r\n\r\nコードは、SNOMED CTなどの非常に形式的な定義まで、列挙またはコードリストで非常にカジュアルに定義できます。詳細については、HL7 v3コア原則を参照してください。"
      },
      {
        "id": "Location.name",
        "path": "Location.name",
        "short": "Name of the location as used by humans / 人間が使用する場所の名前",
        "definition": "Name of the location as used by humans. Does not need to be unique.\r\n\r\n人間が使用する場所の名前。一意である必要はありません。",
        "comment": "If the name of a location changes, consider putting the old name in the alias column so that it can still be located through searches.\r\n\r\n場所の名前が変更された場合は、古い名前をエイリアス列に入力して、検索で検索できるようにすることを検討してください。"
      },
      {
        "id": "Location.alias",
        "path": "Location.alias",
        "short": "A list of alternate names that the location is known as, or was known as, in the past / その場所が過去に知られていた、または以前から知られていた別名のリスト",
        "definition": "A list of alternate names that the location is known as, or was known as, in the past.\r\n\r\nその場所が過去に知られていた、または以前から知られていた別名のリスト",
        "comment": "There are no dates associated with the alias/historic names, as this is not intended to track when names were used, but to assist in searching so that older names can still result in identifying the location.\r\n\r\nエイリアス/歴史的な名前に関連付けられた日付はありません。これは、名前がいつ使用されたかを追跡するためではなく、古い名前でも場所を特定できるように検索を支援するためのものです。",
        "requirements": "Over time locations and organizations go through many changes and can be known by different names.\n\nFor searching knowing previous names that the location was known by can be very useful.\r\n\r\n「時間の経過とともに、場所や組織は多くの変化を遂げ、さまざまな名前で知られるようになります。\r\n場所が知られている以前の名前を知っていることを検索することは非常に役に立ちます。」"
      },
      {
        "id": "Location.description",
        "path": "Location.description",
        "short": "Additional details about the location that could be displayed as further information to identify the location beyond its name / 名前以外の場所を識別するための詳細情報として表示できる場所に関する追加の詳細",
        "definition": "Description of the Location, which helps in finding or referencing the place.\r\n\r\n場所の説明。場所の検索や参照に役立ちます。",
        "comment": "Note that FHIR strings SHALL NOT exceed 1MB in size\r\n\r\nFHIR文字列はサイズが1MBを超えてはならないことに注意してください",
        "requirements": "Humans need additional information to verify a correct location has been identified.\r\n\r\n人間は、正しい場所が特定されたことを確認するために追加情報を必要とします。"
      },
      {
        "id": "Location.mode",
        "path": "Location.mode",
        "short": "instance | kind / インスタンス|種類",
        "definition": "Indicates whether a resource instance represents a specific location or a class of locations.\r\n\r\nリソースインスタンスが特定の場所を表すか、場所のクラスを表すかを示します。",
        "comment": "This is labeled as a modifier because whether or not the location is a class of locations changes how it can be used and understood.\r\n\r\nロケーションがロケーションのクラスであるかどうかによって、その使用方法と理解方法が変わるため、これは修飾子としてラベル付けされます。",
        "requirements": "When using a Location resource for scheduling or orders, we need to be able to refer to a class of Locations instead of a specific Location.\r\n\r\nスケジュールや順番に場所リソースを使用する場合、特定の場所ではなく場所のクラスを参照できる必要があります。"
      },
      {
        "id": "Location.type",
        "path": "Location.type",
        "short": "Type of function performed / 実行される機能のタイプ",
        "definition": "Indicates the type of function performed at the location.\r\n\r\nその場所で実行される機能のタイプを示します。",
        "comment": "Not all terminology uses fit this general pattern. In some cases, models should not use CodeableConcept and use Coding directly and provide their own structure for managing text, codings, translations and the relationship between elements and pre- and post-coordination.\r\n\r\nすべての用語の使用がこの一般的なパターンに適合するわけではありません。場合によっては、モデルはCodeableConceptを使用せず、コーディングを直接使用して、テキスト、コーディング、翻訳、および要素と前後の調整間の関係を管理するための独自の構造を提供する必要があります。"
      },
      {
        "id": "Location.telecom",
        "path": "Location.telecom",
        "short": "Contact details of the location / 所在地の連絡先",
        "definition": "The contact details of communication devices available at the location. This can include phone numbers, fax numbers, mobile numbers, email addresses and web sites.\r\n\r\nその場所で利用可能な通信機器の連絡先。これには、電話番号、ファックス番号、携帯電話番号、電子メールアドレス、ウェブサイトなどが含まれます。"
      },
      {
        "id": "Location.address",
        "path": "Location.address",
        "short": "Physical location / 物理的な場所",
        "definition": "Physical location.\r\n\r\n物理的な場所。",
        "comment": "Additional addresses should be recorded using another instance of the Location resource, or via the Organization.\r\n\r\n追加のアドレスは、Location リソースの別のインスタンスを使用して記録するか、Organization を介して記録する必要があります。",
        "requirements": "If locations can be visited, we need to keep track of their address.\r\n\r\n場所が訪問できる場合は、住所を把握しておく必要があります。"
      },
      {
        "id": "Location.physicalType",
        "path": "Location.physicalType",
        "short": "Physical form of the location / 場所の物理的な形態",
        "definition": "Physical form of the location, e.g. building, room, vehicle, road.\r\n\r\n場所の物理的な形、例えば建物、部屋、車両、道路。",
        "comment": "Not all terminology uses fit this general pattern. In some cases, models should not use CodeableConcept and use Coding directly and provide their own structure for managing text, codings, translations and the relationship between elements and pre- and post-coordination.\r\n\r\nすべての用語の使用がこの一般的なパターンに適合するわけではない。いくつかのケースでは、モデルはCodeableConceptを使用せず、Codingを直接使用し、テキスト、コーディング、翻訳、要素間の関係、および前後の調整を管理するための独自の構造を提供することが望ましい。",
        "requirements": "For purposes of showing relevant locations in queries, we need to categorize locations.\r\n\r\nクエリで関連する場所を表示するためには、場所を分類する必要があります。"
      },
      {
        "id": "Location.position",
        "path": "Location.position",
        "short": "The absolute geographic location / 絶対的な地理的位置",
        "definition": "The absolute geographic location of the Location, expressed using the WGS84 datum (This is the same co-ordinate system used in KML).\r\n\r\nWGS84 データム（KML で使用されている座標系と同じ）を用いて表現された Location の絶対地理的位置。",
        "requirements": "For mobile applications and automated route-finding knowing the exact location of the Location is required.\r\n\r\nモバイルアプリケーションや自動化されたルート検索では、位置情報の正確な位置を知る必要があります。"
      },
      {
        "id": "Location.position.longitude",
        "path": "Location.position.longitude",
        "short": "Longitude with WGS84 datum / WGS84データの経度",
        "definition": "Longitude. The value domain and the interpretation are the same as for the text of the longitude element in KML (see notes below).\r\n\r\n\r\n経度。値の領域及び解釈は、KML の longitude 要素のテキストと同様である（後述）。",
        "comment": "Do not use an IEEE type floating point type, instead use something that works like a true decimal, with inbuilt precision (e.g. Java BigInteger)\r\n\r\n\r\nIEEE型の浮動小数点型は使用せず、真の10進数のように動作し、精度が組み込まれているものを使用してください（例：JavaのBigInteger）。"
      },
      {
        "id": "Location.position.latitude",
        "path": "Location.position.latitude",
        "short": "Latitude with WGS84 datum / WGS84データの緯度",
        "definition": "Latitude. The value domain and the interpretation are the same as for the text of the latitude element in KML (see notes below).\r\n\r\n\r\n緯度。値領域及び解釈は、KML の latitude 要素のテキストと同様である（後述）。",
        "comment": "Do not use an IEEE type floating point type, instead use something that works like a true decimal, with inbuilt precision (e.g. Java BigInteger)\r\n\r\n\r\nIEEE型の浮動小数点型は使用せず、真の10進数のように動作し、精度が組み込まれているものを使用してください（例：JavaのBigInteger）。"
      },
      {
        "id": "Location.position.altitude",
        "path": "Location.position.altitude",
        "short": "Altitude with WGS84 datum / WGS84データによる高度",
        "definition": "Altitude. The value domain and the interpretation are the same as for the text of the altitude element in KML (see notes below).\r\n\r\n\r\n高度。値領域及び解釈は、KML の altitude 要素のテキストと同様である（後述）。",
        "comment": "Do not use an IEEE type floating point type, instead use something that works like a true decimal, with inbuilt precision (e.g. Java BigInteger)\r\n\r\n\r\nIEEE型の浮動小数点型は使用せず、真の10進数のように動作し、精度が組み込まれているものを使用してください（例：JavaのBigInteger）。"
      },
      {
        "id": "Location.managingOrganization",
        "path": "Location.managingOrganization",
        "short": "Organization responsible for provisioning and upkeep / プロビジョニングと維持管理を担当する組織",
        "definition": "The organization responsible for the provisioning and upkeep of the location.\r\n\r\n場所のプロビジョニングと維持管理を担当する組織。",
        "comment": "This can also be used as the part of the organization hierarchy where this location provides services. These services can be defined through the HealthcareService resource.\r\n\r\nこれは、この場所がサービスを提供する組織階層の一部として使用することもできます。これらのサービスは、HealthcareServiceリソースを介して定義することができます。",
        "requirements": "Need to know who manages the location.\r\n\r\n\r\n場所を管理している人を知る必要があります。"
      },
      {
        "id": "Location.partOf",
        "path": "Location.partOf",
        "short": "Another Location this one is physically a part of / この場所が物理的に存在するもう一つの場所",
        "definition": "Another Location of which this Location is physically a part of.\r\n\r\nこの場所が物理的に存在するもう一つの場所。",
        "comment": "References SHALL be a reference to an actual FHIR resource, and SHALL be resolveable (allowing for access control, temporary unavailability, etc.). Resolution can be either by retrieval from the URL, or, where applicable by resource type, by treating an absolute reference as a canonical URL and looking it up in a local registry/repository.\r\n\r\n参照は、実際のFHIRリソースへの参照である必要があり、解決可能（内容に到達可能）である必要がある（アクセス制御、一時的な使用不可などを考慮に入れる）。解決は、URLから取得するか、リソースタイプによって該当する場合は、絶対参照を正規URLとして扱い、ローカルレジストリ/リポジトリで検索することによって行うことができる。",
        "requirements": "For purposes of location, display and identification, knowing which locations are located within other locations is important.\r\n\r\n位置情報、表示、識別のためには、他のどの場所の内部にどの場所があるかを知ることが重要である。"
      },
      {
        "id": "Location.hoursOfOperation",
        "path": "Location.hoursOfOperation",
        "short": "What days/times during a week is this location usually open / この場所は通常、1週間のうち何日/時間帯に営業しています。",
        "definition": "What days/times during a week is this location usually open.\r\n\r\nこの場所が週に何日あるいは何時間オープンしているか。",
        "comment": "This type of information is commonly found published in directories and on websites informing customers when the facility is available.\n\nSpecific services within the location may have their own hours which could be shorter (or longer) than the locations hours.\r\n\r\nこの種の情報は、一般的にディレクトリやウェブサイトに掲載されており、施設が利用可能な時間帯を顧客に通知している。\r\nその場所の特定のサービスは、その場所の時間よりも短い（または長い）独自の時間を持っている場合がある。"
      },
      {
        "id": "Location.hoursOfOperation.daysOfWeek",
        "path": "Location.hoursOfOperation.daysOfWeek",
        "short": "mon | tue | wed | thu | fri | sat | sun / 月｜火｜水｜木｜金｜土｜日",
        "definition": "Indicates which days of the week are available between the start and end Times.\r\n\r\n\r\n開始時刻と終了時刻の間に利用可能な曜日を示します。",
        "comment": "Note that FHIR strings SHALL NOT exceed 1MB in size\r\n\r\n\r\nFHIR文字列のサイズは1MBを超えてはならないことに注意してください。"
      },
      {
        "id": "Location.hoursOfOperation.allDay",
        "path": "Location.hoursOfOperation.allDay",
        "short": "The Location is open all day / その場所は終日営業しています",
        "definition": "The Location is open all day.\r\n\r\n\r\nその場所は終日営業しています。"
      },
      {
        "id": "Location.hoursOfOperation.openingTime",
        "path": "Location.hoursOfOperation.openingTime",
        "short": "Time that the Location opens / 場所が開く時間",
        "definition": "Time that the Location opens.\r\n\r\n\r\n場所が開く時間"
      },
      {
        "id": "Location.hoursOfOperation.closingTime",
        "path": "Location.hoursOfOperation.closingTime",
        "short": "Time that the Location closes / 場所が閉まる時間",
        "definition": "Time that the Location closes.\r\n\r\n\r\n場所が閉まる時間"
      },
      {
        "id": "Location.availabilityExceptions",
        "path": "Location.availabilityExceptions",
        "short": "Description of availability exceptions / 利用可能の例外についての説明。",
        "definition": "A description of when the locations opening ours are different to normal, e.g. public holiday availability. Succinctly describing all possible exceptions to normal site availability as detailed in the opening hours Times.\r\n\r\n場所が私たちのものを開くときの説明は、通常、例えば、祝日の可用性とは異なる。\r\n営業時間に詳細な通常のサイトの利用可能性のすべての可能性のある例外を簡潔に説明する。"
      },
      {
        "id": "Location.endpoint",
        "path": "Location.endpoint",
        "short": "Technical endpoints providing access to services operated for the location / 場所のために運営されているサービスへのアクセスを提供する技術的なエンドポイント",
        "definition": "Technical endpoints providing access to services operated for the location.\r\n\r\n場所のために運営されているサービスへのアクセスを提供する技術的なエンドポイント。",
        "comment": "References SHALL be a reference to an actual FHIR resource, and SHALL be resolveable (allowing for access control, temporary unavailability, etc.). Resolution can be either by retrieval from the URL, or, where applicable by resource type, by treating an absolute reference as a canonical URL and looking it up in a local registry/repository.\r\n\r\n参照は、実際のFHIRリソースへの参照である必要があり、解決可能（内容に到達可能）である必要がある（アクセス制御、一時的な使用不可などを考慮に入れる）。解決は、URLから取得するか、リソースタイプによって該当する場合は、絶対参照を正規URLとして扱い、ローカルレジストリ/リポジトリで検索することによって行うことができる。",
        "requirements": "Organizations may have different systems at different locations that provide various services and need to be able to define the technical connection details for how to connect to them, and for what purpose.\r\n\r\n組織は、さまざまなサービスを提供するさまざまな場所に異なるシステムを持っている可能性があり、それらに接続する方法や目的のための技術的な接続の詳細を定義できる必要があります。"
      }
    ]
  }
}