{
  "resourceType": "StructureDefinition",
  "url": "http://jpfhir.jp/fhir/core/StructureDefinition/JP_Observation_Common",
  "version": "1.0.0",
  "name": "JP_Observation_Common",
  "title": "JP_Observation_Common",
  "status": "active",
  "publisher": "FHIR® Japanese implementation research working group in Japan Association of Medical Informatics (JAMI)",
  "description": "このプロファイルはObservationリソースに対して、データを送受信するための共通の制約と拡張を定めたものである。",
  "copyright": "FHIR® Japanese implementation research working group in Japan Association of Medical Informatics (JAMI)",
  "fhirVersion": "4.0.1",
  "kind": "resource",
  "abstract": false,
  "type": "Observation",
  "baseDefinition": "http://hl7.org/fhir/StructureDefinition/Observation",
  "derivation": "constraint",
  "differential": {
    "element": [
      {
        "id": "Observation",
        "path": "Observation",
        "short": "測定や簡単な観察事実（assertion）",
        "definition": "患者、デバイス、またはその他の対象について行われた測定と簡単な観察事実（assertion）。",
        "comment": "すべてのObservation（検査測定や観察事実）の共通部分のプロファイル"
      },
      {
        "id": "Observation.identifier",
        "path": "Observation.identifier",
        "short": "Business Identifier for observation　Observationのためのビジネス識別子",
        "definition": "A unique identifier assigned to this observation.\r\nObservationに割り当てられたユニーク（一意）の識別ID"
      },
      {
        "id": "Observation.basedOn",
        "path": "Observation.basedOn",
        "short": "Fulfills plan, proposal or order　実施されるプラン、提案、依頼",
        "definition": "A plan, proposal or order that is fulfilled in whole or in part by this event.  For example, a MedicationRequest may require a patient to have laboratory test performed before  it is dispensed.\r\nこのイベントによって全体または部分的に実施されるプラン、提案、依頼。たとえばMedicationRequest は調剤される前に臨床検査を患者に行う必要があるかもしれない。"
      },
      {
        "id": "Observation.partOf",
        "path": "Observation.partOf",
        "short": "Part of referenced event　参照されるイベントの一部分",
        "definition": "A larger event of which this particular Observation is a component or step.  For example,  an observation as part of a procedure.\r\nこの特定のObservationが別のより大きなイベントの要素あるいは一段階であるような親イベント。たとえば、一連の処置手順の一部としてのObservation.",
        "comment": "To link an Observation to an Encounter use `encounter`.  See the  [Notes](observation.html#obsgrouping) below for guidance on referencing another Observation.\r\nObservationをEncounterにencounter要素を使ってリンクする。もうひとつ別のObservationを参照することについては、以降にあるt [Notes](observation.html#obsgrouping)　をガイダンスとして参照のこと。"
      },
      {
        "id": "Observation.status",
        "path": "Observation.status",
        "definition": "The status of the result value.　結果値のステータス。",
        "comment": "This element is labeled as a modifier because the status contains codes that mark the resource as not currently valid.\r\nこのリソースは現在有効でないというマークをするコードを含んでいるため、この要素はモディファイアー（修飾的要素）として位置づけられている。"
      },
      {
        "id": "Observation.category",
        "path": "Observation.category",
        "short": "Classification of  type of observation　Obserbationの種類（タイプ）の分類",
        "definition": "A code that classifies the general type of observation being made.\r\n実施されているobservationの一般的なタイプを分類するコード",
        "comment": "In addition to the required category valueset, this element allows various categorization schemes based on the owner’s definition of the category and effectively multiple categories can be used at once.  The level of granularity is defined by the category concepts in the value set.\r\n必要なカテゴリ値セットに加えて、この要素を使用すると、所有者のカテゴリの定義に基づいたさまざまなカテゴリ化スキームが可能になり、複数のカテゴリを一度に効果的に使用できます。粒度のレベルは、値セットのカテゴリの概念によって定義される。"
      },
      {
        "id": "Observation.code",
        "path": "Observation.code",
        "short": "Type of observation (code / type)　observation のタイプ（コードまたはタイプ）",
        "definition": "Describes what was observed. Sometimes this is called the observation \"name\".\r\n\r\nobservationの対象物を記述する。 observation の名前で呼ばれることもある。",
        "comment": "*All* code-value and, if present, component.code-component.value pairs need to be taken into account to correctly understand the meaning of the observation.\r\nobservationの意味を正しく理解するには、すべてのcode-valueペアと、さらに存在する場合にはcomponent.code-component.valueのペアが、考慮される必要がある。"
      },
      {
        "id": "Observation.subject",
        "path": "Observation.subject",
        "short": "Who and/or what the observation is about　観察対象者",
        "definition": "The patient, or group of patients, location, or device this observation is about and into whose record the observation is placed. If the actual focus of the observation is different from the subject (or a sample of, part, or region of the subject), the `focus` element or the `code` itself specifies the actual focus of the observation.\r\nこの観察が行われた対象となる患者、または患者のグループ、場所、またはデバイス、あるいはそれらの記録。\r\nもし観察の実際の焦点が対象（または対象のサンプル、一部、または領域）と異なる場合、 `focus`要素または` code`自体が観察の実際の焦点を指し示す。",
        "comment": "One would expect this element to be a cardinality of 1..1. The only circumstance in which the subject can be missing is when the observation is made by a device that does not know the patient. In this case, the observation SHALL be matched to a patient through some context/channel matching technique, and at this point, the observation should be updated.\r\nこの要素は1..1のcardinalityになるはずと考えられる。この要素が欠損値になる唯一の状況は、対象患者が不明なデバイスによって観察が行われるケースである。この場合、観察は何らかのコンテキスト/チャネルマッチング技術を介して患者にマッチングされる必要があり、患者にマッチングされれば、その時点で本要素を更新する必要がある。"
      },
      {
        "id": "Observation.focus",
        "path": "Observation.focus",
        "short": "What the observation is about, when it is not about the subject of record　subject 要素が実際のobservationの対象でない場合に、observation の対象物。",
        "definition": "The actual focus of an observation when it is not the patient of record representing something or someone associated with the patient such as a spouse, parent, fetus, or donor. For example, fetus observations in a mother's record.  The focus of an observation could also be an existing condition,  an intervention, the subject's diet,  another observation of the subject,  or a body structure such as tumor or implanted device.   An example use case would be using the Observation resource to capture whether the mother is trained to change her child's tracheostomy tube. In this example, the child is the patient of record and the mother is the focus.\r\n配偶者、親、胎児、ドナーなど、患者に関連する何かまたは誰かを表す記録の患者ではない場合の、観察の実際の焦点。たとえば、母親の記録にある胎児の観察。観察の焦点はまた、既存の状態、介入、対象の食事、対象の別の観察、または腫瘍または埋め込まれた装置などの体の構造であり得る。使用例はobservationリソースを使用して、母親が子供の気管切開チューブを交換するように訓練されているかどうかをキャプチャすることです。この例では、子供が記録の患者であり、母親が焦点（focus）となる。",
        "comment": "Typically, an observation is made about the subject - a patient, or group of patients, location, or device - and the distinction between the subject and what is directly measured for an observation is specified in the observation code itself ( e.g., \"Blood Glucose\") and does not need to be represented separately using this element.  Use `specimen` if a reference to a specimen is required.  If a code is required instead of a resource use either  `bodysite` for bodysites or the standard extension [focusCode](extension-observation-focuscode.html).\r\n通常、observationは対象（患者、または患者のグループ、場所、またはデバイス）について行われ、対象とobservationのために直接測定されるものとの区別は、observationコード自体（例：「血糖値」 ）で記述され、この要素を使用して個別に表す必要はない。検体（標本）への参照が必要な場合は、 `specimin`要素を使用する。リソースの代わりにコードが必要な場合は、人体部位には`bodysite`要素を使用するか、標準の拡張機能[focusCode]（extension-observation-focuscode.html）を使用する。"
      },
      {
        "id": "Observation.encounter",
        "path": "Observation.encounter",
        "short": "Healthcare event during which this observation is made　このobservationが行われるヘルスケアイベント",
        "definition": "The healthcare event  (e.g. a patient and healthcare provider interaction) during which this observation is made.\r\nこのobservationが行われるヘルスケアイベント（患者とヘルスケアプロバイダーの相互作用など）（受診、入院など）。",
        "comment": "This will typically be the encounter the event occurred within, but some events may be initiated prior to or after the official completion of an encounter but still be tied to the context of the encounter (e.g. pre-admission laboratory tests).\r\n通常、イベントが発生したEncounterですが、一部のイベントは、エンEncounterの正式な完了の前または後に開始される場合があり、その場合でもEncounterのコンテキストに関連付けられている（例：入院前の臨床検査）。"
      },
      {
        "id": "Observation.effective[x]",
        "path": "Observation.effective[x]",
        "short": "Clinically relevant time/time-period for observation　臨床的に関連する時刻または時間",
        "definition": "The time or time-period the observed value is asserted as being true. For biological subjects - e.g. human patients - this is usually called the \"physiologically relevant time\". This is usually either the time of the procedure or of specimen collection, but very often the source of the date/time is not known, only the date/time itself.\r\n観測値が関連する時間または期間。レポートの対象が患者である場合、これは通常、処置や検体採取の時刻のいずれかですが、日付/時刻の出処は不明であり、日付/時刻自体のみのことがある。",
        "comment": "At least a date should be present unless this observation is a historical report.  For recording imprecise or \"fuzzy\" times (For example, a blood glucose measurement taken \"after breakfast\") use the [Timing](datatypes.html#timing) datatype which allow the measurement to be tied to regular life events.\r\nこの観察結果が過去の報告でない限り、少なくとも日付が存在する必要があります。不正確または「あいまいな」時間を記録するには（たとえば、「朝食後」に行われた血糖測定）、[Timing]（datatypes.html＃timing）データ型を使用して、測定を通常のライフイベントに関連付けることができる。"
      },
      {
        "id": "Observation.issued",
        "path": "Observation.issued",
        "short": "Date/Time this version was made available　このバージョンが利用可能となった日時",
        "definition": "The date and time this version of the observation was made available to providers, typically after the results have been reviewed and verified.\r\nこのバージョンのレポートが医療者に提供された日時。通常、レポートがレビューおよび検証された後となる。",
        "comment": "For Observations that don’t require review and verification, it may be the same as the [`lastUpdated` ](resource-definitions.html#Meta.lastUpdated) time of the resource itself.  For Observations that do require review and verification for certain updates, it might not be the same as the `lastUpdated` time of the resource itself due to a non-clinically significant update that doesn’t require the new version to be reviewed and verified again.\r\nレビューと検証を必要としないobservationの場合、リソース自体の[`lastUpdated`]（resource-definitions.html＃Meta.lastUpdated）日時と同じになる場合があります。特定の更新のレビューと検証が必要なobservationの場合、新しいバージョンを再度レビューして検証する必要がないような臨床的に重要でない更新がなされたために、リソース自体の「lastUpdated」時間はこれと異なる場合がある。"
      },
      {
        "id": "Observation.performer",
        "path": "Observation.performer",
        "short": "Who is responsible for the observation　observationに責任をもつ者",
        "definition": "Who was responsible for asserting the observed value as \"true\".\r\nそのobservationは真だと言える責任者",
        "comment": "References SHALL be a reference to an actual FHIR resource, and SHALL be resolveable (allowing for access control, temporary unavailability, etc.). Resolution can be either by retrieval from the URL, or, where applicable by resource type, by treating an absolute reference as a canonical URL and looking it up in a local registry/repository.\r\n参照は、実際のFHIRリソースへの参照である必要があり、解決可能（内容に到達可能）である必要がある（アクセス制御、一時的な使用不可などを考慮に入れる）。解決は、URLから取得するか、リソースタイプによって該当する場合は、絶対参照を正規URLとして扱い、ローカルレジストリ/リポジトリで検索することによって行うことができる。"
      },
      {
        "id": "Observation.value[x]",
        "path": "Observation.value[x]",
        "short": "Actual result　実際の結果値",
        "definition": "The information determined as a result of making the observation, if the information has a simple value.\r\n結果情報が単純な値である場合、observationを行った結果として決定された情報。"
      },
      {
        "id": "Observation.dataAbsentReason",
        "path": "Observation.dataAbsentReason",
        "short": "Why the result is missing　結果が欠損値である理由",
        "definition": "Provides a reason why the expected value in the element Observation.value[x] is missing.\r\nObservation.value[x] 要素に期待される結果が存在しない理由を設定する。",
        "comment": "Null or exceptional values can be represented two ways in FHIR Observations.  One way is to simply include them in the value set and represent the exceptions in the value.  For example, measurement values for a serology test could be  \"detected\", \"not detected\", \"inconclusive\", or  \"specimen unsatisfactory\".   \n\nThe alternate way is to use the value element for actual observations and use the explicit dataAbsentReason element to record exceptional values.  For example, the dataAbsentReason code \"error\" could be used when the measurement was not completed. Note that an observation may only be reported if there are values to report. For example differential cell counts values may be reported only when > 0.  Because of these options, use-case agreements are required to interpret general observations for null or exceptional values.\r\n\r\nヌル値または例外値は、FHIRオブザベーションで2つの方法で表すことができる。 1つの方法は、それらを値セットに含めて、値の例外を表す方法である。たとえば、血清学的検査の測定値は、「検出された」、「検出されなかった」、「決定的でない」、または「検体が不十分」である可能性がある。別の方法は、実際の観測にvalue要素を使用し、明示的なdataAbsentReason要素を使用して例外的な値を記録することである。たとえば、測定が完了しなかった場合、dataAbsentReasonコード「error」を使用できる。この場合には、観測値は、報告する値がある場合にのみ報告される可能性があることに注意する必要がある。たとえば、差分セルカウント値は> 0の場合にのみ報告される場合がある。これらのオプションのため、nullまたは例外値の一般的な観測値を解釈するにはユースケースの合意が必要である。"
      },
      {
        "id": "Observation.interpretation",
        "path": "Observation.interpretation",
        "definition": "A categorical assessment of an observation value.  For example, high, low, normal.\r\n観測値のカテゴリ別評価。たとえば、高、低、通常。",
        "comment": "Historically used for laboratory results (known as 'abnormal flag' ),  its use extends to other use cases where coded interpretations  are relevant.  Often reported as one or more simple compact codes this element is often placed adjacent to the result value in reports and flow sheets to signal the meaning/normalcy status of the result.\r\n\r\n「異常フラグ」として呼ばれる検査結果解釈コードが従来から使用されており、その使用はコード化された解釈が関連するような他の場合でも拡大して使われている。多くの場合、1つ以上の単純でコンパクトなコードとして報告され、この要素は、結果の意味や正常かどうかを示すために、レポートや時系列表で結果値の隣に配置されることがよくあります。",
        "requirements": "For some results, particularly numeric results, an interpretation is necessary to fully understand the significance of a result.\r\n一部の結果、特に数値結果については、結果の意義を完全に理解するためには解釈コードが必要である。"
      },
      {
        "id": "Observation.note",
        "path": "Observation.note",
        "short": "Comments about the observation　結果に対するコメント",
        "definition": "Comments about the observation or the results.\r\n観測値、結果に対するコメント",
        "comment": "May include general statements about the observation, or statements about significant, unexpected or unreliable results values, or information about its source when relevant to its interpretation.\r\n\r\n観察（結果）に関する一般的な記述、重要な、予期しない、または信頼できない結果値に関する記述、またはその解釈に関連する場合はそのソースに関する情報が含まれる場合がある。",
        "requirements": "Need to be able to provide free text additional information.\r\nフリーテキストの追加情報を提供できる必要がある。"
      },
      {
        "id": "Observation.bodySite",
        "path": "Observation.bodySite",
        "short": "Observed body part　観察された身体部位",
        "definition": "Indicates the site on the subject's body where the observation was made (i.e. the target site).\r\n観察が行われた被験者の体の部位（すなわち、標的部位）を示します。",
        "comment": "Only used if not implicit in code found in Observation.code.  In many systems, this may be represented as a related observation instead of an inline component.   \n\nIf the use case requires BodySite to be handled as a separate resource (e.g. to identify and track separately) then use the standard extension[ bodySite](extension-bodysite.html).\r\n\r\nObservation.codeにあるコードだけでは暗黙的に部位はわからない場合にだけ使用される。多くのシステムでは、これはデータ中の部分情報ではなく関連する観察（観測）として記述さえる場合がある。\r\nもしBodySiteを個別のリソースとして処理する必要があるような使用例（たとえば、個別に識別して追跡するなど）においては、標準の拡張機能[bodySite]（extension-bodysite.html）を使用する。"
      },
      {
        "id": "Observation.method",
        "path": "Observation.method",
        "short": "How it was done　どのように実施されたか。",
        "definition": "Indicates the mechanism used to perform the observation.\r\n観測を実行するために使用されるメカニズムを示す。",
        "comment": "Only used if not implicit in code for Observation.code.\r\nObservation.codeのコードでは暗黙的に示されない場合にだけ使用する。",
        "requirements": "In some cases, method can impact results and is thus used for determining whether results can be compared or determining significance of results.\r\n場合によっては、観察（観測・検査）方法によっては結果に影響を与える可能性があるため、結果を比較できるかどうかを判断したり、結果の重要性を判断したりするために使用される。"
      },
      {
        "id": "Observation.specimen",
        "path": "Observation.specimen",
        "short": "Specimen used for this observation　観察（観測、検査）に使われた検体材料",
        "definition": "The specimen that was used when this observation was made.\r\nこの観察（観測、検査）が実施されたときに使われた検体材料",
        "comment": "Should only be used if not implicit in code found in `Observation.code`.  Observations are not made on specimens themselves; they are made on a subject, but in many cases by the means of a specimen. Note that although specimens are often involved, they are not always tracked and reported explicitly. Also note that observation resources may be used in contexts that track the specimen explicitly (e.g. Diagnostic Report).\r\n`Observation.code`にあるコードで暗黙的に示されない場合にのみ使用する必要がある。検体自体の観察は行われない。観察（観測、検査）対象者に対して実施されるが、多くの場合には対象者から得られた検体に対して実施される。検体が奥の場合に関わるが、それらは常に追跡され、明示的に報告されるとは限らないことに注意すること。またobservationリソースは、検体を明示的に記述するような状況下（診断レポートなど）で使用される場合があることに注意。"
      },
      {
        "id": "Observation.device",
        "path": "Observation.device",
        "short": "(Measurement) Device　測定機器",
        "definition": "The device used to generate the observation data.\r\n観察データを生成するために使われた機器",
        "comment": "Note that this is not meant to represent a device involved in the transmission of the result, e.g., a gateway.  Such devices may be documented using the Provenance resource where relevant.\r\nこれは、結果の送信に関与するデバイス（ゲートウェイなど）を表すことを意図したものではない。そのようなデバイスは、必要に応じてProvenanceリソースを使用して文書化する。"
      },
      {
        "id": "Observation.referenceRange",
        "path": "Observation.referenceRange",
        "short": "Provides guide for interpretation　解釈のためのガイドを与える",
        "comment": "Most observations only have one generic reference range. Systems MAY choose to restrict to only supplying the relevant reference range based on knowledge about the patient (e.g., specific to the patient's age, gender, weight and other factors), but this might not be possible or appropriate. Whenever more than one reference range is supplied, the differences between them SHOULD be provided in the reference range and/or age properties.\r\n通常の範囲または推奨範囲と比較して値を解釈する方法に関するガイダンス。複数の参照範囲は「OR」として解釈されます。つまり、2つの異なるターゲット母集団を表すために、2つの `referenceRange`要素が使用される。",
        "requirements": "Knowing what values are considered \"normal\" can help evaluate the significance of a particular result. Need to be able to provide multiple reference ranges for different contexts.\r\nどの値が「正常」と見なされるかを知ることは、特定の結果の意義を評価するのに役立つ。さまざまなコンテキストに対応するため複数の参照範囲を提供できる必要がある。"
      },
      {
        "id": "Observation.hasMember",
        "path": "Observation.hasMember",
        "short": "Related resource that belongs to the Observation group　observationグループに属する関連リソース",
        "definition": "This observation is a group observation (e.g. a battery, a panel of tests, a set of vital sign measurements) that includes the target as a member of the group.\r\nこのobserbationは、グループのメンバーとしてターゲットを含むグループobserbation（たとえば、一連検査セット、パネル検査、バイタルサイン測定値のセット）です。",
        "comment": "When using this element, an observation will typically have either a value or a set of related resources, although both may be present in some cases.  For a discussion on the ways Observations can assembled in groups together, see [Notes](observation.html#obsgrouping) below.  Note that a system may calculate results from [QuestionnaireResponse](questionnaireresponse.html)  into a final score and represent the score as an Observation.\r\nこの要素を使用する場合、observationには通常、値または関連するリソースのセットのいじれかを含む。その両方を含む場合もある。複数のobservationをグループに一緒にまとめる方法については、以下の[メモ]（observation.html＃obsgrouping）を参照せよ。システムは、[QuestionnaireResponse]（questionnaireresponse.html）からの結果を計算して最終スコアにし、そのスコアをobservationとして表す場合があることに注意。"
      },
      {
        "id": "Observation.derivedFrom",
        "path": "Observation.derivedFrom",
        "short": "Related measurements the observation is made from　observation がつくりゃれる元の関連する測定",
        "definition": "The target resource that represents a measurement from which this observation value is derived. For example, a calculated anion gap or a fetal measurement based on an ultrasound image.\r\nこのobservation が導出される元の測定値を表すターゲットリソース。たとえば、超音波画像に基づいて計算されたアニオンギャップまたは胎児の測定値の場合、この要素には、元となった超音波画像検査結果への参照を設定する。",
        "comment": "All the reference choices that are listed in this element can represent clinical observations and other measurements that may be the source for a derived value.  The most common reference will be another Observation.  For a discussion on the ways Observations can assembled in groups together, see [Notes](observation.html#obsgrouping) below.\r\nこの要素にリストされているすべての参照の選択肢は、派生値の元のデータなる可能性のある臨床観察やその他の測定値を表すことができる。最も一般的な参照先は、別のobserbationです。obserbationをグループに一緒にまとめる方法については、以下の[メモ]（observation.html＃obsgrouping）を参照してください。"
      },
      {
        "id": "Observation.component",
        "path": "Observation.component",
        "short": "Component results　　コンポーネント結果",
        "definition": "Some observations have multiple component observations.  These component observations are expressed as separate code value pairs that share the same attributes.  Examples include systolic and diastolic component observations for blood pressure measurement and multiple component observations for genetics observations.\r\n一部の観測には、複数のコンポーネントの観測がある。これらのコンポーネントの観察結果は、同じ属性を共有する個別のコード値のペアとして表される。例としては、血圧測定のための収縮期および拡張期のコンポーネントの観察や、遺伝学の観察のための複数のコンポーネントの観察がある。",
        "comment": "For a discussion on the ways Observations can be assembled in groups together see [Notes](observation.html#notes) below.\r\n複数のObservation をグループに一緒にまとめる方法については、以下の[Notes]（observation.html＃notes）を参照してください。",
        "requirements": "Component observations share the same attributes in the Observation resource as the primary observation and are always treated a part of a single observation (they are not separable).   However, the reference range for the primary observation value is not inherited by the component values and is required when appropriate for each component observation.\r\nコンポーネントobservation は プライマリobservation としてのobservation リソースの中で同じ属性を共有し、常に単一のobservation の一部として扱われる（つまりそれらは分離可能ではないん）。ただし、プライマリobservationのreference rangeはコンポーネント値に継承されないため、reference rangeは各コンポーネントobservation に適切であれば必要である。"
      }
    ]
  }
}